Repository: MedaminDamino/AskCam
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

# actionDeleted
source: Deleted.
ar: تم الحذف.
fr: Supprime.

# actionDeleteFailed
source: Failed to delete. Please try again.
ar: فشل الحذف. حاول مرة أخرى.
fr: Suppression echouee. Veuillez reessayer.

# actionCopied
source: Copied to clipboard.
ar: تم النسخ إلى الحافظة.
fr: Copie dans le presse-papiers.

# uploadingImage
source: Uploading image to cloud...
ar: جارٍ رفع الصورة إلى السحابة...
fr: Televersement de l'image...

# uploadFailedTryAgain
source: Upload failed. Please try again.
ar: فشل الرفع. حاول مرة أخرى.
fr: Televersement echoue. Veuillez reessayer.

# errorNoInternetConnection
source: No internet connection
ar: لا يوجد اتصال بالإنترنت
fr: Pas de connexion internet

# cloudinaryNotConfigured
source: Cloudinary is not configured. Please run the app with {args}
ar: Cloudinary غير مُهيأ. شغّل التطبيق باستخدام {args}
fr: Cloudinary n'est pas configure. Lancez l'application avec {args}

# settingsTitle
source: Settings
ar: الإعدادات
fr: Parametres

# settingsSectionPreferences
source: Preferences
ar: التفضيلات

# settingsTheme
source: Theme
ar: السمة

# settingsDarkMode
source: Dark mode
ar: الوضع الداكن
fr: Mode sombre

# settingsSectionFeedback
source: Sound & Haptics
ar: الصوت والاهتزاز
fr: Son et vibration

# settingsSilentMode
source: Silent mode
ar: الوضع الصامت
fr: Mode silencieux

# settingsSilentModeHint
source: Silent mode disables sound and vibration.
ar: الوضع الصامت يعطل الصوت والاهتزاز.
fr: Le mode silencieux desactive le son et la vibration.

# settingsSoundEnabled
source: Button sounds
ar: أصوات الأزرار
fr: Sons des boutons

# settingsVibrationEnabled
source: Vibration
ar: الاهتزاز

# settingsSectionReminders
source: Reminders
ar: التذكيرات
fr: Rappels

# settingsReminderToggle
source: Usage reminder
ar: تذكير الاستخدام
fr: Rappel d'utilisation

# settingsReminderHint
source: Get a reminder every 15 minutes.
ar: احصل على تذكير كل 15 دقيقة.
fr: Recevoir un rappel toutes les 15 minutes.

# settingsSectionAbout
source: About
ar: حول
fr: A propos

# settingsSectionOcr
source: OCR & ML
ar: OCR و ML
fr: OCR et ML

# settingsAutoEnhanceImages
source: Auto-enhance images before OCR
ar: تحسين الصور تلقائيًا قبل OCR
fr: Ameliorer les images avant OCR

# settingsAutoDetectLanguage
source: Auto-detect language
ar: كشف اللغة تلقائيًا
fr: Detecter la langue automatiquement

# settingsAutoDetectLanguageHint
source: When disabled, the app assumes the selected language.
ar: عند التعطيل، يفترض التطبيق اللغة المحددة.
fr: Si desactive, l'application suppose la langue selectionnee.

# settingsSectionPrivacy
source: Privacy & Cache
ar: الخصوصية والذاكرة المؤقتة
fr: Confidentialite et cache

# settingsClearCache
source: Clear cache
ar: مسح الذاكرة المؤقتة
fr: Vider le cache

# settingsClearCacheWeb
source: Cache cleanup skipped on web.
ar: تم تخطي تنظيف الذاكرة المؤقتة على الويب.
fr: Nettoyage du cache ignore sur le web.

# settingsClearCacheDone
source: Cache cleared successfully.
ar: تم مسح الذاكرة المؤقتة بنجاح.
fr: Cache vide avec succes.

# settingsClearCacheFail
source: Unable to clear cache. Please try again.
ar: تعذر مسح الذاكرة المؤقتة. حاول مرة أخرى.
fr: Impossible de vider le cache. Veuillez reessayer.

# settingsSectionAccount
source: Account
ar: الحساب
fr: Compte

# settingsLoggedInAs
source: Signed in as
ar: تم تسجيل الدخول كـ
fr: Connecte en tant que
