Repository: MedaminDamino/AskCam
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

# reminderTitle
source: ðŸ“¸ AskCam Reminder
ar: 📸 تذكير AskCam
fr: ðŸ“¸ Rappel AskCam

# reminderBody
source: Scan your documents and understand them with AskCam.
ar: امسح مستنداتك وافهمها باستخدام AskCam.
fr: Scannez vos documents et comprenez-les avec AskCam.

# reminderChannelName
source: AskCam Reminders
ar: تذكيرات AskCam
fr: Rappels AskCam

# reminderChannelDescription
source: Periodic reminders to use AskCam.
ar: تذكيرات دورية لاستخدام AskCam.
fr: Rappels periodiques pour utiliser AskCam.

# tooltipLightMode
source: Light mode
ar: الوضع الفاتح
fr: Mode clair

# tooltipDarkMode
source: Dark mode
ar: الوضع الداكن
fr: Mode sombre

# authErrorMessage
source: Authentication error: {message}
ar: خطأ في المصادقة: {message}
fr: Erreur d'authentification : {message}

# routeErrorTitle
source: Error
ar: خطأ
fr: Erreur

# routeErrorHeading
source: Oops! Something went wrong
ar: عذرًا! حدث خطأ ما
fr: Oups ! Une erreur est survenue

# routeErrorRoute
source: Route: {route}
ar: المسار: {route}

# routeErrorGoHome
source: Go to Home
ar: اذهب إلى الرئيسية
fr: Aller a l'accueil

# routeErrorNoImage
source: No image file provided
ar: لم يتم توفير ملف صورة
fr: Aucun fichier image fourni

# routeErrorInvalidArgs
source: Invalid arguments: {argType}
ar: وسائط غير صالحة: {argType}
fr: Arguments invalides : {argType}

# routeErrorImageNotFound
source: Image file not found
ar: لم يتم العثور على ملف الصورة
fr: Fichier image introuvable

# routeErrorMissingTranslate
source: Missing translate arguments
ar: وسائط الترجمة مفقودة
fr: Arguments de traduction manquants

# routeErrorMissingAi
source: Missing AI arguments
ar: وسائط الذكاء الاصطناعي مفقودة
fr: Arguments IA manquants

# routeErrorNotFound
source: Route not found
ar: المسار غير موجود
fr: Route introuvable

# validationEmailRequired
source: Email is required
ar: البريد الإلكتروني مطلوب
fr: L'email est obligatoire

# validationEmailInvalid
source: Enter a valid email address
ar: أدخل بريدًا إلكترونيًا صالحًا
fr: Entrez une adresse email valide

# validationPasswordRequired
source: Password is required
ar: كلمة المرور مطلوبة
fr: Le mot de passe est obligatoire

# validationPasswordMinLength
source: Password must be at least 8 characters
ar: يجب أن تكون كلمة المرور 8 أحرف على الأقل
fr: Le mot de passe doit contenir au moins 8 caracteres

# validationPasswordUppercase
source: Password must include at least 1 uppercase letter
ar: يجب أن تحتوي كلمة المرور على حرف كبير واحد على الأقل
fr: Le mot de passe doit contenir au moins 1 majuscule

# validationPasswordNumber
source: Password must include at least 1 number
ar: يجب أن تحتوي كلمة المرور على رقم واحد على الأقل
fr: Le mot de passe doit contenir au moins 1 chiffre

# validationFieldRequired
source: {field} is required
ar: {field} مطلوب
fr: {field} est obligatoire

# validationFieldMinLength
source: {field} must be at least 2 characters
ar: يجب أن يحتوي {field} على حرفين على الأقل
fr: {field} doit contenir au moins 2 caracteres

# validationConfirmPasswordRequired
source: Please confirm your password
ar: يرجى تأكيد كلمة المرور
fr: Veuillez confirmer votre mot de passe

# validationPasswordMismatch
source: Passwords do not match
ar: كلمتا المرور غير متطابقتين
fr: Les mots de passe ne correspondent pas

# authSignInFailed
source: Sign-in failed. Please try again.
ar: فشل تسجيل الدخول. حاول مرة أخرى.
fr: Echec de connexion. Veuillez reessayer.

# authSignInCancelled
source: Sign-in cancelled.
ar: تم إلغاء تسجيل الدخول.
fr: Connexion annulee.

# authGoogleSignInFailed
source: Google sign-in failed. Please try again.
ar: فشل تسجيل الدخول عبر Google. حاول مرة أخرى.
fr: Connexion Google echouee. Veuillez reessayer.

# authRegistrationFailed
source: Registration failed. Please try again.
ar: فشل التسجيل. حاول مرة أخرى.
fr: Inscription echouee. Veuillez reessayer.

# authResetFailed
source: Reset failed. Please try again.
ar: فشلت إعادة التعيين. حاول مرة أخرى.
fr: Reinitialisation echouee. Veuillez reessayer.

# authSignOutFailed
source: Unable to sign out. Please try again.
ar: تعذر تسجيل الخروج. حاول مرة أخرى.
fr: Impossible de se deconnecter. Veuillez reessayer.

# authErrorInvalidEmail
source: The email address is not valid.
ar: عنوان البريد الإلكتروني غير صالح.
fr: L'adresse email n'est pas valide.

# authErrorUserNotFound
source: No user found for that email.
ar: لا يوجد مستخدم بهذا البريد الإلكتروني.
fr: Aucun utilisateur pour cet email.

# authErrorWrongPassword
source: Incorrect password. Please try again.
ar: كلمة المرور غير صحيحة. حاول مرة أخرى.
fr: Mot de passe incorrect. Veuillez reessayer.

# authErrorEmailInUse
source: An account already exists for that email.
ar: يوجد حساب بالفعل لهذا البريد الإلكتروني.
fr: Un compte existe deja avec cet email.

# authErrorWeakPassword
source: Your password is too weak. Use at least 8 characters, 1 uppercase letter, and 1 number.
ar: كلمة المرور ضعيفة جدًا. استخدم 8 أحرف على الأقل، وحرفًا كبيرًا واحدًا، ورقمًا واحدًا.
fr: Mot de passe trop faible. Utilisez au moins 8 caracteres, 1 majuscule et 1 chiffre.

# authErrorInvalidCredential
source: Invalid credentials. Double-check your email and password.
ar: بيانات الاعتماد غير صالحة. تحقق من البريد وكلمة المرور.
fr: Identifiants invalides. Verifiez votre email et mot de passe.

# authErrorAccountExistsDifferentMethod
source: An account already exists with a different sign-in method.
ar: يوجد حساب بالفعل بطريقة تسجيل مختلفة.
fr: Un compte existe deja avec une methode de connexion differente.

# authErrorOperationNotAllowed
source: Email/password sign-in is disabled for this project.
ar: تسجيل الدخول بالبريد وكلمة المرور معطل لهذا المشروع.
fr: La connexion email/mot de passe est desactivee pour ce projet.

# authErrorUserDisabled
source: This account has been disabled.
ar: تم تعطيل هذا الحساب.
fr: Ce compte a ete desactive.

# authErrorPopupBlocked
source: Popup blocked. Please allow popups and try again.
ar: تم حظر النافذة المنبثقة. اسمح بالنوافذ المنبثقة ثم حاول مرة أخرى.
fr: Popup bloquee. Autorisez les popups puis reessayez.

# authErrorTooManyRequests
source: Too many attempts. Please try again later.
ar: محاولات كثيرة جدًا. حاول لاحقًا.
fr: Trop de tentatives. Veuillez reessayer plus tard.

# authErrorInvalidApiKey
source: Invalid Firebase API key. Check your web configuration.
ar: مفتاح Firebase API غير صالح. تحقق من إعدادات الويب.
fr: Cle API Firebase invalide. Verifiez la configuration web.

# authErrorNetwork
source: Network error. Check your connection and try again.
ar: خطأ في الشبكة. تحقق من الاتصال وحاول مرة أخرى.
fr: Erreur reseau. Verifiez votre connexion et reessayez.

# authErrorGeneric
source: Authentication failed ({code}). Please try again.
ar: فشلت المصادقة ({code}). حاول مرة أخرى.
fr: Echec d'authentification ({code}). Veuillez reessayer.

# authErrorGoogleConfig
source: Google sign-in configuration error (SHA/package/OAuth).
ar: خطأ في إعدادات تسجيل Google (SHA/الحزمة/OAuth).
fr: Erreur de configuration Google (SHA/package/OAuth).

# authErrorGoogleSignIn
source: Google sign-in failed ({code}). Please try again.
ar: فشل تسجيل الدخول عبر Google ({code}). حاول مرة أخرى.
fr: Connexion Google echouee ({code}). Veuillez reessayer.

# fieldFirstName
source: First name
ar: الاسم الأول
fr: Prenom

# fieldLastName
source: Last name
ar: اسم العائلة
fr: Nom

# fieldEmail
source: Email
ar: البريد الإلكتروني

# fieldPassword
source: Password
ar: كلمة المرور
fr: Mot de passe

# fieldConfirmPassword
source: Confirm password
ar: تأكيد كلمة المرور
fr: Confirmer le mot de passe

# authAccountCreated
source: Account created successfully.
ar: تم إنشاء الحساب بنجاح.
fr: Compte cree avec succes.

# authRegisterSubtitle
source: Join AskCam in a few steps
ar: انضم إلى AskCam في بضع خطوات
fr: Rejoignez AskCam en quelques etapes

# authAlreadyHaveAccount
source: Already have an account?
ar: لديك حساب بالفعل؟
fr: Vous avez deja un compte ?

# authSignIn
source: Sign in
ar: تسجيل الدخول
fr: Se connecter

# googleSignInButton
source: Continue with Google
ar: المتابعة باستخدام Google
fr: Continuer avec Google

# authWelcomeBack
source: Welcome back
ar: مرحبًا بعودتك
fr: Bon retour

# authSignInToContinue
source: Sign in to continue
ar: سجل الدخول للمتابعة
fr: Connectez-vous pour continuer

# authForgotPassword
source: Forgot password?
ar: هل نسيت كلمة المرور؟
fr: Mot de passe oublie ?

# authNewHere
source: New here?
ar: جديد هنا؟
fr: Nouveau ici ?

# authCreateAccount
source: Create account
ar: إنشاء حساب
fr: Creer un compte

# authLoginFailed
source: Login failed.
ar: فشل تسجيل الدخول.
fr: Connexion echouee.

# authResetEmailSent
source: Password reset email sent.
ar: تم إرسال رسالة إعادة تعيين كلمة المرور.
fr: Email de reinitialisation envoye.

# authRequestFailed
source: Request failed.
ar: فشل الطلب.
fr: Requete echouee.

# authResetPasswordTitle
source: Reset password
ar: إعادة تعيين كلمة المرور
fr: Reinitialiser le mot de passe

# authResetPasswordSubtitle
source: Enter your email and we will send a reset link.
ar: أدخل بريدك الإلكتروني وسنرسل رابط إعادة التعيين.
fr: Entrez votre email et nous vous enverrons un lien de reinitialisation.

# authResetPasswordAction
source: Send reset link
ar: إرسال رابط إعادة التعيين
fr: Envoyer le lien

# authLogout
source: Logout
ar: تسجيل الخروج
fr: Se deconnecter

# authLogoutConfirmation
source: Are you sure you want to log out?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟
fr: Voulez-vous vous deconnecter ?

# authLogoutFailed
source: Logout failed.
ar: فشل تسجيل الخروج.
fr: Deconnexion echouee.

# authLoginRequiredToViewGallery
source: Please login to view your gallery.
ar: يرجى تسجيل الدخول لعرض المعرض.
fr: Veuillez vous connecter pour voir votre galerie.

# authLoginRequiredToViewHistory
source: Please login to view history.
ar: يرجى تسجيل الدخول لعرض السجل.
fr: Veuillez vous connecter pour voir l'historique.

# authLoginRequiredToSaveImages
source: Please login to save images.
ar: يرجى تسجيل الدخول لحفظ الصور.
fr: Veuillez vous connecter pour enregistrer les images.

# authLoginRequiredToSaveWords
source: Please login to save words.
ar: يرجى تسجيل الدخول لحفظ الكلمات.

# authLoginRequiredToSaveHistory
source: Please login to save history.
ar: يرجى تسجيل الدخول لحفظ السجل.
fr: Veuillez vous connecter pour enregistrer l'historique.

# authGoToLogin
source: Go to Login
ar: اذهب إلى تسجيل الدخول
fr: Aller a la connexion

# aiNotConfigured
source: AI is not configured. Please run the app with {args}
ar: الذكاء الاصطناعي غير مُهيأ. شغّل التطبيق باستخدام {args}
fr: L'IA n'est pas configuree. Lancez l'application avec {args}

# aiNoImageAvailable
source: No image available for AI analysis.
ar: لا توجد صورة متاحة لتحليل الذكاء الاصطناعي.
fr: Aucune image disponible pour l'analyse IA.

# aiUnclearImage
source: I couldn't detect readable text or a clear question in this image. Please try another image or crop the area you want.
ar: تعذر اكتشاف نص مقروء أو سؤال واضح في هذه الصورة. جرّب صورة أخرى أو قص الجزء المطلوب.
fr: Je n'ai pas detecte de texte lisible ou de question claire dans cette image. Essayez une autre image ou recadrez la zone voulue.

# aiServiceUnavailable
source: We could not reach the AI service right now. Please try again later.
ar: لا يمكن الوصول إلى خدمة الذكاء الاصطناعي حاليًا. حاول لاحقًا.
fr: Impossible de joindre le service IA pour le moment. Veuillez reessayer plus tard.

# aiAnswerCopied
source: AI answer copied to clipboard.
ar: تم نسخ إجابة الذكاء الاصطناعي.
fr: Reponse IA copiee dans le presse-papiers.

# aiAskTitle
source: Ask AI
ar: اسأل الذكاء الاصطناعي
fr: Demander a l'IA

# aiAskQuestionTitle
source: Ask a question
ar: اطرح سؤالًا
fr: Poser une question

# aiAskQuestionHint
source: Optional: ask AI about the extracted text / image...
ar: اختياري: اسأل الذكاء الاصطناعي عن النص المستخرج/الصورة...
fr: Optionnel : demander a l'IA a propos du texte ou de l'image...

# aiAsking
source: Asking AI...
ar: جارٍ سؤال الذكاء الاصطناعي...
fr: Demande a l'IA...

# aiAsk
source: Ask AI
ar: اسأل الذكاء الاصطناعي
fr: Demander a l'IA

# aiAskAboutThis
source: Ask AI about this
ar: اسأل الذكاء الاصطناعي عن هذا
fr: Demander a l'IA a propos de ceci

# aiAnswerTitle
source: AI Answer
ar: إجابة الذكاء الاصطناعي
fr: Reponse IA

# aiResponseLabel
source: Response
ar: الرد
fr: Reponse

# aiResponsePlaceholder
source: AI response will appear here.
ar: ستظهر إجابة الذكاء الاصطناعي هنا.
fr: La reponse de l'IA apparaitra ici.

# aiNoImageProvided
source: No image provided
ar: لم يتم توفير صورة
fr: Aucune image fournie

# aiNoAnswerFallback
source: The AI could not come up with an answer. Please try again.
ar: لم يتمكن الذكاء الاصطناعي من تقديم إجابة. حاول مرة أخرى.
fr: L'IA n'a pas pu fournir de reponse. Veuillez reessayer.

# aiEmptyHint
source: Ask AI to see step-by-step explanations or hints here.
ar: اسأل الذكاء الاصطناعي لعرض شروحات خطوة بخطوة أو تلميحات هنا.
fr: Demandez a l'IA pour voir des explications ou des indices ici.

# aiWaitingResponse
source: Waiting for the AI assistant to respond...
ar: بانتظار رد مساعد الذكاء الاصطناعي...
fr: En attente de la reponse de l'IA...

# cameraPickImageError
source: Error picking image: {error}
ar: خطأ أثناء اختيار الصورة: {error}
fr: Erreur lors du choix de l'image : {error}

# cameraTitle
source: Capture Moment
ar: التقاط اللحظة
fr: Capture

# cameraClearImage
source: Clear Image
ar: مسح الصورة
fr: Supprimer l'image

# cameraNoImageSelected
source: No image selected
ar: لم يتم اختيار صورة
fr: Aucune image selectionnee

# cameraEmptyHint
source: Tap the buttons below to get started
ar: اضغط الأزرار بالأسفل للبدء
fr: Appuyez sur les boutons ci-dessous pour commencer

# cameraImageCaptured
source: Image captured successfully
ar: تم التقاط الصورة بنجاح
fr: Image capturee avec succes

# cameraGallery
source: Gallery
ar: المعرض
fr: Galerie

# cameraCamera
source: Camera
ar: الكاميرا

# cameraScanWithAi
source: Scan Text with AI
ar: مسح النص بالذكاء الاصطناعي
fr: Scanner le texte avec l'IA

source: About Application
ar: حول التطبيق
fr: A propos de l'application

# aboutDescription
source: AskCam is a Flutter mobile application that allows users to capture or upload images, extract text using ML Kit OCR, translate the extracted text, and ask AI questions to better understand documents and homework.
ar: AskCam هو تطبيق Flutter للهواتف يتيح للمستخدمين التقاط أو تحميل الصور، واستخراج النص باستخدام ML Kit OCR، وترجمة النص المستخرج، وطرح أسئلة على الذكاء الاصطناعي لفهم المستندات والواجبات بشكل أفضل.
fr: AskCam vous aide a capturer ou importer des images, extraire le texte avec OCR sur l'appareil, le traduire en plusieurs langues et poser des questions a l'IA pour mieux comprendre vos documents et devoirs.

# aboutMlKitServicesTitle
source: ML Kit services used
ar: خدمات ML Kit المستخدمة
fr: Fonctionnalites ML Kit

# aboutMlKitTextRecognition
source: Text Recognition (OCR)
ar: التعرّف على النص (OCR)
fr: Reconnaissance de texte (OCR)

# aboutMlKitTranslation
source: On-device Translation
ar: الترجمة على الجهاز
fr: Traduction linguistique

# aboutAiServiceTitle
source: AI service
ar: خدمة الذكاء الاصطناعي
fr: Comprehension IA

# aboutAiServiceGemini
source: Gemini API
ar: واجهة Gemini
fr: Gemini IA

# aboutTargetUsersTitle
source: Target users
ar: الفئة المستهدفة
fr: Utilisateurs cibles

# aboutTargetUsersStudents
source: Students and learners
ar: الطلاب والمتعلمون
fr: Etudiants et apprenants

# galleryDeleteTitle
source: Delete image?
ar: حذف الصورة؟
fr: Supprimer l'image ?

# galleryDeleteMessage
source: Remove this image from your gallery?
ar: إزالة هذه الصورة من المعرض؟
fr: Supprimer cette image de votre galerie ?

# galleryImageLoadFailed
source: Unable to load image.
ar: تعذر تحميل الصورة.
fr: Impossible de charger l'image.

# galleryTitle
source: Gallery
ar: المعرض
fr: Galerie

# galleryLoadFailed
source: Unable to load gallery.
ar: تعذر تحميل المعرض.
fr: Impossible de charger la galerie.

# galleryEmpty
source: No images yet.
ar: لا توجد صور بعد.
fr: Aucune image pour le moment.

# savedWordsDeleteTitle
source: Delete saved word?
ar: حذف الكلمة المحفوظة؟

# savedWordsDeleteMessage
source: Remove "{word}" from your saved words?
ar: إزالة "{word}" من الكلمات المحفوظة؟

# historyDeleteTitle
source: Delete history item?
ar: حذف عنصر السجل؟
fr: Supprimer l'element d'historique ?

# historyDeleteMessage
source: Remove this extraction from history?
ar: إزالة هذا الاستخراج من السجل؟
fr: Supprimer cette extraction de l'historique ?

# historyTitle
source: History
ar: السجل
fr: Historique

# historyTab
source: History
ar: السجل

# savedWordsTab
source: Saved Words
ar: الكلمات المحفوظة

# historyLoadFailed
source: Unable to load history.
ar: تعذر تحميل السجل.
fr: Impossible de charger l'historique.

# historyEmpty
source: No history yet.
ar: لا يوجد سجل بعد.
fr: Aucun historique pour le moment.

# historyNoExtractedText
source: No extracted text
ar: لا يوجد نص مستخرج
fr: Aucun texte extrait

# historyNoText
source: No text to save yet.
ar: لا يوجد نص للحفظ بعد.
fr: Aucun texte a enregistrer.

# historySaved
source: Saved to history.
ar: تم الحفظ في السجل.
fr: Enregistre dans l'historique.

# historySaveFailed
source: Failed to save.
ar: فشل الحفظ.
fr: Echec de l'enregistrement.

# savedWordsSearchHint
source: Search saved words
ar: البحث في الكلمات المحفوظة

# savedWordsLoadFailed
source: Unable to load saved words.
ar: تعذر تحميل الكلمات المحفوظة.

# savedWordsEmpty
source: No saved words yet.
ar: لا توجد كلمات محفوظة بعد.

# timeJustNow
source: Just now
ar: الآن
fr: A l'instant

source: Notifications enabled
ar: الإشعارات مفعلة
fr: Notifications activees

source: Notifications disabled
ar: الإشعارات معطلة
fr: Notifications desactivees

source: Language
ar: اللغة
fr: Langue

# languageEnglish
source: English
ar: الإنجليزية
fr: Anglais

# languageFrench
source: French
ar: الفرنسية
fr: Francais

# languageArabic
source: Arabic
ar: العربية
fr: Arabe

# homeWelcome
source: Welcome to
ar: مرحبًا بك في
fr: Bienvenue sur

# homeTagline
source: Capture, analyze, and discover insights from your images
ar: التقط، حلل، واكتشف رؤى من صورك
fr: Capturez, analysez et decouvrez vos images

# homeCamera
source: Camera
ar: الكاميرا

# homeCameraSubtitle
source: Take a photo
ar: التقط صورة
fr: Prendre une photo

# homeGallery
source: Gallery
ar: المعرض
fr: Galerie

# homeGallerySubtitle
source: Browse photos
ar: تصفّح الصور
fr: Voir les photos

# homeHistory
source: History
ar: السجل
fr: Historique

# homeHistorySubtitle
source: Past scans
ar: عمليات مسح سابقة
fr: Scans precedents

# homeSettings
source: Settings
ar: الإعدادات
fr: Parametres

# homeSettingsSubtitle
source: Preferences
ar: التفضيلات

# reminderPermissionDenied
source: Notification permission denied.
ar: تم رفض إذن الإشعارات.
fr: Permission de notification refusee.

# ocrErrorUnableToRead
source: We could not read this photo. Please retake it in better lighting.
ar: تعذر قراءة هذه الصورة. التقطها مجددًا بإضاءة أفضل.
fr: Impossible de lire cette photo. Reprenez-la avec un meilleur eclairage.

# ocrUnableToExtract
source: Unable to extract text. Please try another photo.
ar: تعذر استخراج النص. جرّب صورة أخرى.
fr: Impossible d'extraire le texte. Essayez une autre photo.

# ocrOriginalText
source: Original text
ar: النص الأصلي
fr: Texte original

# ocrExtractingHint
source: We are extracting text from the photo. Please hold tight.
ar: نقوم باستخراج النص من الصورة. يرجى الانتظار.
fr: Nous extrayons le texte de la photo. Patientez.

# ocrTranslatedTextTitle
source: Translated text ({lang})
ar: النص المترجم ({lang})
fr: Texte traduit ({lang})

# translationWaitingForOcr
source: Translation will appear once OCR completes.
ar: ستظهر الترجمة بعد اكتمال التعرف على النص.
fr: La traduction apparaitra une fois l'OCR termine.

# translationInProgress
source: Translating to {language}...
ar: جارٍ الترجمة إلى {language}...
fr: Traduction vers {language}...

source: Translate into:
ar: ترجم إلى:
fr: Traduire en :

# translationAutoReapplyHint
source: Changing this option re-translates the detected text automatically.
ar: تغيير هذا الخيار يعيد ترجمة النص المكتشف تلقائيًا.
fr: Changer cette option retraduit automatiquement le texte detecte.

# translationUnavailableFallback
source: Translation unavailable right now. Showing the detected text instead.
ar: الترجمة غير متاحة حاليًا. سيتم عرض النص المكتشف.
fr: Traduction indisponible. Affichage du texte detecte.

# translationUnavailableOriginal
source: Translation unavailable right now. Showing the original text.
ar: الترجمة غير متاحة حاليًا. سيتم عرض النص الأصلي.
fr: Traduction indisponible. Affichage du texte original.

# translationFailedTryAgain
source: Unable to translate. Please try again.
ar: تعذرت الترجمة. حاول مرة أخرى.
fr: Impossible de traduire. Veuillez reessayer.

# translationCopied
source: Translated text copied to clipboard.
ar: تم نسخ النص المترجم.
fr: Texte traduit copie dans le presse-papiers.

# translationInProgressShort
source: Translating...
ar: جارٍ الترجمة...
fr: Traduction...

# translationOutputPlaceholder
source: Translation will appear here.
ar: ستظهر الترجمة هنا.
fr: La traduction apparaitra ici.

# translationNoText
source: No text to translate yet.
ar: لا يوجد نص للترجمة بعد.
fr: Aucun texte a traduire pour le moment.

# translateTitle
source: Translate
ar: ترجمة
fr: Traduire

# translateInputTitle
source: Text to translate
ar: نص للترجمة
fr: Texte a traduire

# translateInputHint
source: Edit the text to translate...
ar: عدّل النص المراد ترجمته...
fr: Modifiez le texte a traduire...

# translateAction
source: Translate
ar: ترجمة
fr: Traduire

# translateOutputTitle
source: Translated output
ar: الناتج المترجم
fr: Texte traduit

# ocrExtractResultTitle
source: Extract Result
ar: نتيجة الاستخراج
fr: Resultat d'extraction

# ocrOriginalExtractedText
source: Original extracted text
ar: النص المستخرج الأصلي
fr: Texte extrait

# ocrExtractingText
source: Extracting text...
ar: جارٍ استخراج النص...
fr: Extraction du texte...

# ocrRunning
source: OCR is running...
ar: التعرف على النص يعمل...
fr: OCR en cours...

# ocrEditHint
source: Edit the extracted text here.
ar: عدّل النص المستخرج هنا.
fr: Modifiez le texte extrait ici.

# ocrEditInstruction
source: Edit the text if OCR missed anything before translating or asking AI.
ar: عدّل النص إذا فات التعرف على شيء قبل الترجمة أو سؤال الذكاء الاصطناعي.
fr: Modifiez le texte si l'OCR a manque quelque chose avant de traduire ou demander a l'IA.

# saveWordsNoText
source: No text to save yet.
ar: لا يوجد نص للحفظ بعد.

# saveWordsSelectOrTypeError
source: Select a word/phrase first or type one.
ar: حدد كلمة/عبارة أولًا أو اكتب واحدة.

# saveWordsLengthError
source: Word length must be between 2 and 120 characters.
ar: يجب أن يكون طول الكلمة بين 2 و120 حرفًا.

# saveWordsAlreadySaved
source: Already saved.
ar: تم حفظها بالفعل.

# saveWordsSaved
source: Saved.
ar: تم الحفظ.

# saveWordsFailed
source: Failed to save, try again.
ar: فشل الحفظ، حاول مرة أخرى.

# saveWordsTitle
source: Save words
ar: حفظ الكلمات

# saveWordsInstruction
source: Select a word or phrase in the text above, or type one below.
ar: حدد كلمة أو عبارة من النص أعلاه أو اكتب واحدة أدناه.

# saveWordsHint
source: Type a word or phrase to save
ar: اكتب كلمة أو عبارة للحفظ

# historySaveAction
source: Save history
ar: حفظ السجل
fr: Enregistrer l'historique

# saveWordsAction
source: Save words
ar: حفظ الكلمات

# actionHome
source: Home
ar: الرئيسية
fr: Accueil

# actionTranslate
source: Translate
ar: ترجمة
fr: Traduire

# actionAskAi
source: Ask AI
ar: اسأل الذكاء الاصطناعي
fr: Demander a l'IA

# actionSave
source: Save
ar: حفظ
fr: Enregistrer

# actionRetry
source: Retry
ar: إعادة المحاولة
fr: Reessayer

# actionCopy
source: Copy
ar: نسخ
fr: Copier

# actionBack
source: Back
ar: رجوع
fr: Retour

# actionBackToExtract
source: Back to Extract
ar: العودة إلى الاستخراج
fr: Retour a l'extraction

# actionCancel
source: Cancel
ar: إلغاء
fr: Annuler

# actionDelete
source: Delete
ar: حذف
fr: Supprimer
